In [143]:
import pandas as pd

In [144]:
people={'first':['Coery','Jane','John'],
      'last':['Schafer','Doe','Doe'],
       'email':['CoeryMSchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com']
     }

In [145]:
df=pd.DataFrame(people)

In [146]:
df

   first     last                    email
0  Coery  Schafer  CoeryMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

# Rename columns

In [147]:
# Rename all columns name

In [148]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [149]:
df.columns=['first name', 'last name', 'email id']

In [150]:
df

  first name last name                 email id
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [151]:
df.columns

Index(['first name', 'last name', 'email id'], dtype='object')

In [152]:
# Rename a perticular/specific columns name

# syntax : <DataFrame Name>.rename(columns={'<old col name>':'<new col name>'}, inplace = True)

In [153]:
df.rename(columns={'email id':'email'})

  first name last name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [154]:
df

  first name last name                 email id
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [155]:
# If we want this column name permanently, then specify inplace=True

df.rename(columns={'email id':'email'}, inplace=True)

In [156]:
df

  first name last name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

# Change case

In [157]:
# Convert all columns name into upper case

In [158]:
df.columns=[x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME                    EMAIL
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [159]:
# Convert all columns name into Title case (All words first letter is capital)

df.columns=[x.title() for x in df.columns]
df

  First Name Last Name                    Email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

# Replacing

In [160]:
# For replacing we use replace() method

# Syntax : replace( '<old value>' , '<new value>' )

In [161]:
# Replacing space (' ') with '_'  in all columns

df.columns=df.columns.str.replace(' ','_')

In [162]:
df

  First_Name Last_Name                    Email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [163]:
# Change all columns name into small/lower case

df.columns=[x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

## Updating a single Row Data

# By Using loc

In [164]:
# Update a single value

In [165]:
# Change last name to smith, where fast name is John?

df.loc[2]       #grab that row

first_name                 John
last_name                   Doe
email         JohnDoe@gmail.com
Name: 2, dtype: object

In [166]:
df.loc[2]=['John','Smith','Johnsmith@gmail.com']

In [167]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John     Smith      Johnsmith@gmail.com

In [168]:
# If there are huge number of data set , then updating single value on this above way is more difficult and this way is not
# recomanded .


# So, for overcome to this problem , we have to pick value only and update it 

# syntax : <DataFrame name>.loc[<specific row index value>, ['<that specific column name>']] = ['<Update value>']

df.loc[2,'last_name']='Doe'

In [169]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe      Johnsmith@gmail.com

In [170]:
# If Updating more than one value or multiple value in same row, then we have pass that coressponding columns in a list
# and also passing updating value in side a list

df.loc[2,['first_name','last_name','email']]=['J','Smith','JSmith@gmail.com']

In [171]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2          J     Smith         JSmith@gmail.com

# By Using at

In [172]:
# at[] always except 2 positional arguments, 1st position for row and 2nd position for column

# we can't access multiple values by using at[]  ---->  df.at[2,['first_name','last_name','email']]   --> bcz unhashable type

# But we can assign in 2nd position list of columns name for updation  --->
#                                            df.at[2,['first_name','last_name','email']]=['John','Doe','JohnDoe@gmail.com']

# By using at[] , we can't access a specific row , bcz it's always except 2 positional arguments ---->  df.at[0]

In [173]:
df.at[0,'last_name']    # for retriving Only one specific value at is more faster than loc

'Schafer'

In [174]:
df.at[2,'last_name']='Smt'           # Updating a single value

In [175]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2          J       Smt         JSmith@gmail.com

In [176]:
df.at[2,['first_name','last_name','email']]=['John','Doe','JohnDoe@gmail.com']   # Updating multiple value in a same row

In [177]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

# By using Filtering

In [185]:
# Update the lastname to 'smith' where email id is JohnDoe@gmail.com

In [186]:
filt=df['email']=='JohnDoe@gmail.com'

In [189]:
df.loc[filt,'last_name']='Smith'

In [190]:
df

  first_name last_name                    email
0      Coery   Schafer  CoeryMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John     Smith        JohnDoe@gmail.com

# Updating multiple Row data

In [191]:
# Q. Update all email into lower case

In [193]:
df['email'].str.lower()

0    coerymschafer@gmail.com
1          janedoe@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [194]:
df['email']=df['email'].str.lower()

In [195]:
df

  first_name last_name                    email
0      Coery   Schafer  coerymschafer@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John     Smith        johndoe@gmail.com

There are 4 methods by using these we can also update multiple rows value.

    - apply()
    
    - map()
    
    - applymap()
    
    - replace()

# apply()

apply() is use for calling a function on our values
and apply can work either on dataframe or series objects

In [211]:
# On Series objects

In [197]:
df.apply(len)

first_name    3
last_name     3
email         3
dtype: int64

In [199]:
df['email'].apply(len)   # It will return length of all email id present in email column

0    23
1    17
2    17
Name: email, dtype: int64

In [201]:
#To update email id into upper case by using apply()

# for this we have to create changing uppercase function, pass that function into apply()

In [202]:
def upper_case_email(email):
    return email.upper()

In [203]:
df['email'].apply(upper_case_email)

0    COERYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [204]:
df['email']=df['email'].apply(upper_case_email)

In [205]:
df

  first_name last_name                    email
0      Coery   Schafer  COERYMSCHAFER@GMAIL.COM
1       Jane       Doe        JANEDOE@GMAIL.COM
2       John     Smith        JOHNDOE@GMAIL.COM

In [206]:
# By Using lambda function

In [209]:
 df['email']=df['email'].apply(lambda x: x.lower())

In [210]:
df

  first_name last_name                    email
0      Coery   Schafer  coerymschafer@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John     Smith        johndoe@gmail.com

In [212]:
# On DataFrame Objects

In [213]:
# Q. find the min value in each column

# Syntax : <DataFrame name>.apply(pd.Series.min)

In [216]:
df.apply(pd.Series.min)

first_name                      Coery
last_name                         Doe
email         coerymschafer@gmail.com
dtype: object

In [217]:
# Q. find the max value in each column

# Syntax : <DataFrame name>.apply(pd.Series.max)

In [218]:
df.apply(pd.Series.max)

first_name                 John
last_name                 Smith
email         johndoe@gmail.com
dtype: object

In [219]:
#Or,
df.apply(lambda x : x.min())

first_name                      Coery
last_name                         Doe
email         coerymschafer@gmail.com
dtype: object

# applymap()

In [221]:
# applymap() only use for dataframe objects
# it will check every each individual elements one by one present inside dataframe

In [228]:
# Q. find each every elements length present in dataframe

# Syntax : <DataFrame Name>.applymap(len)


df.applymap(len)

#or,

# df.applymap(lambda x: len(x))

   first_name  last_name  email
0           5          7     23
1           4          3     17
2           4          5     17

# map()

In [230]:
# map() function only works on Series objects
# so, map() is for substituting in each value in a series with a another value.

In [234]:
df['first_name'].map({'Coery':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first_name, dtype: object

In [235]:
# If coressponding value is not there then it wil return NaN value,
# So, for this we should go for replace() method,

# replace()

In [236]:
# It will replace the matching value with given coresponding value, and return all value with replaced value

In [237]:
df['first_name'].replace({'Coery':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first_name, dtype: object

# Work with huge data set

In [263]:
survey_df=pd.read_csv('E:\Aroha Tech\Pandas Session\Pandas\Developer Survey 2020\survey_results_public.csv', index_col='Respondent')

schema_df=pd.read_csv('E:\Aroha Tech\Pandas Session\Pandas\Developer Survey 2020\survey_results_schema.csv', index_col="Column")

In [241]:

survey_df.rename(columns={'ConvertedComp':'SalaryUSD'}, inplace=True)

In [242]:
survey_df

,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,SalaryUSD,Country,CurrencyDesc,CurrencySymbol,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
3,I code primarily as a hobby,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
4,I am a developer by profession,Yes,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,ALL,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64858,NaN,Yes,NaN,16,NaN,NaN,NaN,United States,NaN,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,NaN,NaN,10,Less than 1 year
64867,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Morocco,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64898,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Viet Nam,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64925,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Poland,NaN,NaN,...,NaN,NaN,NaN,NaN,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
65112,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Spain,NaN,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN

In [243]:
#Q. Convert Hobbyist column values in to boolean value

In [251]:
survey_df['Hobbyist'].value_counts()

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [252]:
survey_df['Hobbyist']=survey_df['Hobbyist'].map({'Yes':'True','No':'False'})

In [253]:
survey_df

,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,True,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
2,I am a developer by profession,False,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
3,I code primarily as a hobby,True,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
4,I am a developer by profession,True,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,ALL,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
5,"I used to be a developer by profession, but no...",True,31.0,16,NaN,NaN,NaN,United States,NaN,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64858,NaN,True,NaN,16,NaN,NaN,NaN,United States,NaN,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,NaN,NaN,10,Less than 1 year
64867,NaN,True,NaN,NaN,NaN,NaN,NaN,Morocco,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64898,NaN,True,NaN,NaN,NaN,NaN,NaN,Viet Nam,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64925,NaN,True,NaN,NaN,NaN,NaN,NaN,Poland,NaN,NaN,...,NaN,NaN,NaN,NaN,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
65112,NaN,True,NaN,NaN,NaN,NaN,NaN,Spain,NaN,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN

In [254]:
# If we want update some specific value and make other values remain untouched then we must go for replace() method.
# if we go for map() method, then map() update the given value with the matching records , and make untouched/ unmatching
# records to NaN value

In [255]:
survey_df['Hobbyist']=survey_df['Hobbyist'].replace({'Yes':'True','No':'False'})

In [256]:
survey_df['CompFreq'].value_counts()

Yearly     19818
Monthly    18899
Weekly      1352
Name: CompFreq, dtype: int64

In [262]:
# survey_df['CompFreq']=survey_df['CompFreq'].map({'Weekly':'Daily'}) # It will update Weekly to Daily and make other value NaN
#survey_df['CompFreq'].value_counts()  # For Check how meny type of value present after modify
# So, Its better we go for replace() method instead of map()

In [267]:
survey_df['CompFreq']=survey_df['CompFreq'].replace({'Weekly':'Daily'})

In [269]:
survey_df['CompFreq'].value_counts()

Yearly     19818
Monthly    18899
Daily       1352
Name: CompFreq, dtype: int64